# Arithmetic Operations

In [13]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4], "b":[5,6,7,8]})

var

   A  b
0  1  5
1  2  6
2  3  7
3  4  8

In [14]:
var['c'] = var['A'] + var['b']

var

   A  b   c
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [15]:
var['c'] = var['A'] - var['b']

var

   A  b  c
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

In [16]:
var['c'] = var['A'] * var['b']

var

   A  b   c
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [17]:
var['c'] = var['A'] / var['b']

var

   A  b         c
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

Logical Operations

In [18]:
var1 = pd.DataFrame({"A":[10,20,30,40], "b":[15,16,17,18]})

var1

    A   b
0  10  15
1  20  16
2  30  17
3  40  18

In [19]:
var1["Python"] = var1["A"] <= 20
var1['Python1'] = var1['b'] >= 16

var1

    A   b  Python  Python1
0  10  15    True    False
1  20  16    True     True
2  30  17   False     True
3  40  18   False     True

# Insert Functions

In [20]:
import pandas as pd

var = pd.DataFrame({"A":list(range(1,6)), "B":list(range(9,14))})

var

   A   B
0  1   9
1  2  10
2  3  11
3  4  12
4  5  13

In [21]:
var.insert(1, "py1", var["A"])
 
var

   A  py1   B
0  1    1   9
1  2    2  10
2  3    3  11
3  4    4  12
4  5    5  13

In [22]:
var.insert?

In [23]:
var.insert(1, "py2", range(10,15))
 
var

   A  py2  py1   B
0  1   10    1   9
1  2   11    2  10
2  3   12    3  11
3  4   13    4  12
4  5   14    5  13

In [24]:
var["py_23"] = var["A"][0:2] 

var

   A  py2  py1   B  py_23
0  1   10    1   9    1.0
1  2   11    2  10    2.0
2  3   12    3  11    NaN
3  4   13    4  12    NaN
4  5   14    5  13    NaN

# Delete Function

In [26]:
var.pop("py2")

0    10
1    11
2    12
3    13
4    14
Name: py2, dtype: int64

In [27]:
var

   A  py1   B  py_23
0  1    1   9    1.0
1  2    2  10    2.0
2  3    3  11    NaN
3  4    4  12    NaN
4  5    5  13    NaN

In [28]:
del var["py1"]

In [29]:
var

   A   B  py_23
0  1   9    1.0
1  2  10    2.0
2  3  11    NaN
3  4  12    NaN
4  5  13    NaN